__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 96, 96, 3)    0                                            
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 96, 96, 64)   9408        input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 96, 96, 64)   256         conv2d_1[0][0]                   
__________________________________________________________________________________________________
re_lu_1 (ReLU)                  (None, 96, 96, 64)   0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 48, 48, 64)   0           re_lu_1[0][0]                    
__________________________________________________________________________________________________
average_pooling2d_1 (AveragePoo (None, 24, 24, 64)   0           max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 48, 48, 48)   3072        max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 24, 24, 16)   1024        average_pooling2d_1[0][0]        
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 48, 48, 48)   192         conv2d_2[0][0]                   
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 24, 24, 16)   64          conv2d_3[0][0]                   
__________________________________________________________________________________________________
re_lu_2 (ReLU)                  multiple             0           batch_normalization_2[0][0]      
                                                                 batch_normalization_3[0][0]      
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 24, 24, 48)   6912        re_lu_2[1][0]                    
__________________________________________________________________________________________________
average_pooling2d_2 (AveragePoo (None, 24, 24, 48)   0           re_lu_2[0][0]                    
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 48, 48, 48)   20736       re_lu_2[0][0]                    
__________________________________________________________________________________________________
up_sampling2d_1 (UpSampling2D)  (None, 48, 48, 48)   0           conv2d_5[0][0]                   
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 24, 24, 16)   2304        re_lu_2[1][0]                    
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 24, 24, 16)   6912        average_pooling2d_2[0][0]        
__________________________________________________________________________________________________
add_1 (Add)                     (None, 48, 48, 48)   0           conv2d_4[0][0]                   
                                                                 up_sampling2d_1[0][0]            
__________________________________________________________________________________________________
add_2 (Add)                     (None, 24, 24, 16)   0           conv2d_6[0][0]                   
                                                                 conv2d_7[0][0]                   
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 48, 48, 48)   192         add_1[0][0]                      
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 24, 24, 16)   64          add_2[0][0]                      
__________________________________________________________________________________________________
re_lu_3 (ReLU)                  multiple             0           batch_normalization_4[0][0]      
                                                                 batch_normalization_5[0][0]      
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 24, 24, 192)  3072        re_lu_3[1][0]                    
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 24, 24, 192)  3072        re_lu_2[1][0]                    
__________________________________________________________________________________________________
average_pooling2d_3 (AveragePoo (None, 24, 24, 48)   0           re_lu_3[0][0]                    
__________________________________________________________________________________________________
average_pooling2d_4 (AveragePoo (None, 24, 24, 48)   0           re_lu_2[0][0]                    
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 48, 48, 192)  9216        re_lu_3[0][0]                    
__________________________________________________________________________________________________
up_sampling2d_2 (UpSampling2D)  (None, 48, 48, 192)  0           conv2d_9[0][0]                   
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 48, 48, 192)  9216        re_lu_2[0][0]                    
__________________________________________________________________________________________________
up_sampling2d_3 (UpSampling2D)  (None, 48, 48, 192)  0           conv2d_13[0][0]                  
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 24, 24, 64)   1024        re_lu_3[1][0]                    
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 24, 24, 64)   3072        average_pooling2d_3[0][0]        
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 24, 24, 64)   1024        re_lu_2[1][0]                    
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 24, 24, 64)   3072        average_pooling2d_4[0][0]        
__________________________________________________________________________________________________
add_3 (Add)                     (None, 48, 48, 192)  0           conv2d_8[0][0]                   
                                                                 up_sampling2d_2[0][0]            
__________________________________________________________________________________________________
add_5 (Add)                     (None, 48, 48, 192)  0           conv2d_12[0][0]                  
                                                                 up_sampling2d_3[0][0]            
__________________________________________________________________________________________________
add_4 (Add)                     (None, 24, 24, 64)   0           conv2d_10[0][0]                  
                                                                 conv2d_11[0][0]                  
__________________________________________________________________________________________________
add_6 (Add)                     (None, 24, 24, 64)   0           conv2d_14[0][0]                  
                                                                 conv2d_15[0][0]                  
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 48, 48, 192)  768         add_3[0][0]                      
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 48, 48, 192)  768         add_5[0][0]                      
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 24, 24, 64)   256         add_4[0][0]                      
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 24, 24, 64)   256         add_6[0][0]                      
__________________________________________________________________________________________________
add_7 (Add)                     (None, 48, 48, 192)  0           batch_normalization_6[0][0]      
                                                                 batch_normalization_8[0][0]      
__________________________________________________________________________________________________
add_8 (Add)                     (None, 24, 24, 64)   0           batch_normalization_7[0][0]      
                                                                 batch_normalization_9[0][0]      
__________________________________________________________________________________________________
re_lu_6 (ReLU)                  (None, 48, 48, 192)  0           add_7[0][0]                      
__________________________________________________________________________________________________
re_lu_7 (ReLU)                  (None, 24, 24, 64)   0           add_8[0][0]                      
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 24, 24, 48)   3072        re_lu_7[0][0]                    
__________________________________________________________________________________________________
average_pooling2d_5 (AveragePoo (None, 24, 24, 192)  0           re_lu_6[0][0]                    
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 48, 48, 48)   9216        re_lu_6[0][0]                    
__________________________________________________________________________________________________
up_sampling2d_4 (UpSampling2D)  (None, 48, 48, 48)   0           conv2d_17[0][0]                  
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 24, 24, 16)   1024        re_lu_7[0][0]                    
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 24, 24, 16)   3072        average_pooling2d_5[0][0]        
__________________________________________________________________________________________________
add_9 (Add)                     (None, 48, 48, 48)   0           conv2d_16[0][0]                  
                                                                 up_sampling2d_4[0][0]            
__________________________________________________________________________________________________
add_10 (Add)                    (None, 24, 24, 16)   0           conv2d_18[0][0]                  
                                                                 conv2d_19[0][0]                  
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 48, 48, 48)   192         add_9[0][0]                      
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 24, 24, 16)   64          add_10[0][0]                     
__________________________________________________________________________________________________
re_lu_8 (ReLU)                  multiple             0           batch_normalization_10[0][0]     
                                                                 batch_normalization_11[0][0]     
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 24, 24, 48)   6912        re_lu_8[1][0]                    
__________________________________________________________________________________________________
average_pooling2d_6 (AveragePoo (None, 24, 24, 48)   0           re_lu_8[0][0]                    
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 48, 48, 48)   20736       re_lu_8[0][0]                    
__________________________________________________________________________________________________
up_sampling2d_5 (UpSampling2D)  (None, 48, 48, 48)   0           conv2d_21[0][0]                  
__________________________________________________________________________________________________
conv2d_22 (Conv2D)              (None, 24, 24, 16)   2304        re_lu_8[1][0]                    
__________________________________________________________________________________________________
conv2d_23 (Conv2D)              (None, 24, 24, 16)   6912        average_pooling2d_6[0][0]        
__________________________________________________________________________________________________
add_11 (Add)                    (None, 48, 48, 48)   0           conv2d_20[0][0]                  
                                                                 up_sampling2d_5[0][0]            
__________________________________________________________________________________________________
add_12 (Add)                    (None, 24, 24, 16)   0           conv2d_22[0][0]                  
                                                                 conv2d_23[0][0]                  
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 48, 48, 48)   192         add_11[0][0]                     
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 24, 24, 16)   64          add_12[0][0]                     
__________________________________________________________________________________________________
re_lu_9 (ReLU)                  multiple             0           batch_normalization_12[0][0]     
                                                                 batch_normalization_13[0][0]     
__________________________________________________________________________________________________
conv2d_25 (Conv2D)              (None, 24, 24, 192)  3072        re_lu_9[1][0]                    
__________________________________________________________________________________________________
average_pooling2d_7 (AveragePoo (None, 24, 24, 48)   0           re_lu_9[0][0]                    
__________________________________________________________________________________________________
conv2d_24 (Conv2D)              (None, 48, 48, 192)  9216        re_lu_9[0][0]                    
__________________________________________________________________________________________________
up_sampling2d_6 (UpSampling2D)  (None, 48, 48, 192)  0           conv2d_25[0][0]                  
__________________________________________________________________________________________________
conv2d_26 (Conv2D)              (None, 24, 24, 64)   1024        re_lu_9[1][0]                    
__________________________________________________________________________________________________
conv2d_27 (Conv2D)              (None, 24, 24, 64)   3072        average_pooling2d_7[0][0]        
__________________________________________________________________________________________________
add_13 (Add)                    (None, 48, 48, 192)  0           conv2d_24[0][0]                  
                                                                 up_sampling2d_6[0][0]            
__________________________________________________________________________________________________
add_14 (Add)                    (None, 24, 24, 64)   0           conv2d_26[0][0]                  
                                                                 conv2d_27[0][0]                  
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 48, 48, 192)  768         add_13[0][0]                     
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 24, 24, 64)   256         add_14[0][0]                     
__________________________________________________________________________________________________
add_15 (Add)                    (None, 48, 48, 192)  0           batch_normalization_14[0][0]     
                                                                 re_lu_6[0][0]                    
__________________________________________________________________________________________________
add_16 (Add)                    (None, 24, 24, 64)   0           batch_normalization_15[0][0]     
                                                                 re_lu_7[0][0]                    
__________________________________________________________________________________________________
re_lu_11 (ReLU)                 (None, 48, 48, 192)  0           add_15[0][0]                     
__________________________________________________________________________________________________
re_lu_12 (ReLU)                 (None, 24, 24, 64)   0           add_16[0][0]                     
__________________________________________________________________________________________________
conv2d_29 (Conv2D)              (None, 24, 24, 48)   3072        re_lu_12[0][0]                   
__________________________________________________________________________________________________
average_pooling2d_8 (AveragePoo (None, 24, 24, 192)  0           re_lu_11[0][0]                   
__________________________________________________________________________________________________
conv2d_28 (Conv2D)              (None, 48, 48, 48)   9216        re_lu_11[0][0]                   
__________________________________________________________________________________________________
up_sampling2d_7 (UpSampling2D)  (None, 48, 48, 48)   0           conv2d_29[0][0]                  
__________________________________________________________________________________________________
conv2d_30 (Conv2D)              (None, 24, 24, 16)   1024        re_lu_12[0][0]                   
__________________________________________________________________________________________________
conv2d_31 (Conv2D)              (None, 24, 24, 16)   3072        average_pooling2d_8[0][0]        
__________________________________________________________________________________________________
add_17 (Add)                    (None, 48, 48, 48)   0           conv2d_28[0][0]                  
                                                                 up_sampling2d_7[0][0]            
__________________________________________________________________________________________________
add_18 (Add)                    (None, 24, 24, 16)   0           conv2d_30[0][0]                  
                                                                 conv2d_31[0][0]                  
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, 48, 48, 48)   192         add_17[0][0]                     
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, 24, 24, 16)   64          add_18[0][0]                     
__________________________________________________________________________________________________
re_lu_13 (ReLU)                 multiple             0           batch_normalization_16[0][0]     
                                                                 batch_normalization_17[0][0]     
__________________________________________________________________________________________________
conv2d_33 (Conv2D)              (None, 24, 24, 48)   6912        re_lu_13[1][0]                   
__________________________________________________________________________________________________
average_pooling2d_9 (AveragePoo (None, 24, 24, 48)   0           re_lu_13[0][0]                   
__________________________________________________________________________________________________
conv2d_32 (Conv2D)              (None, 48, 48, 48)   20736       re_lu_13[0][0]                   
__________________________________________________________________________________________________
up_sampling2d_8 (UpSampling2D)  (None, 48, 48, 48)   0           conv2d_33[0][0]                  
__________________________________________________________________________________________________
conv2d_34 (Conv2D)              (None, 24, 24, 16)   2304        re_lu_13[1][0]                   
__________________________________________________________________________________________________
conv2d_35 (Conv2D)              (None, 24, 24, 16)   6912        average_pooling2d_9[0][0]        
__________________________________________________________________________________________________
add_19 (Add)                    (None, 48, 48, 48)   0           conv2d_32[0][0]                  
                                                                 up_sampling2d_8[0][0]            
__________________________________________________________________________________________________
add_20 (Add)                    (None, 24, 24, 16)   0           conv2d_34[0][0]                  
                                                                 conv2d_35[0][0]                  
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (None, 48, 48, 48)   192         add_19[0][0]                     
__________________________________________________________________________________________________
batch_normalization_19 (BatchNo (None, 24, 24, 16)   64          add_20[0][0]                     
__________________________________________________________________________________________________
re_lu_14 (ReLU)                 multiple             0           batch_normalization_18[0][0]     
                                                                 batch_normalization_19[0][0]     
__________________________________________________________________________________________________
conv2d_37 (Conv2D)              (None, 24, 24, 192)  3072        re_lu_14[1][0]                   
__________________________________________________________________________________________________
average_pooling2d_10 (AveragePo (None, 24, 24, 48)   0           re_lu_14[0][0]                   
__________________________________________________________________________________________________
conv2d_36 (Conv2D)              (None, 48, 48, 192)  9216        re_lu_14[0][0]                   
__________________________________________________________________________________________________
up_sampling2d_9 (UpSampling2D)  (None, 48, 48, 192)  0           conv2d_37[0][0]                  
__________________________________________________________________________________________________
conv2d_38 (Conv2D)              (None, 24, 24, 64)   1024        re_lu_14[1][0]                   
__________________________________________________________________________________________________
conv2d_39 (Conv2D)              (None, 24, 24, 64)   3072        average_pooling2d_10[0][0]       
__________________________________________________________________________________________________
add_21 (Add)                    (None, 48, 48, 192)  0           conv2d_36[0][0]                  
                                                                 up_sampling2d_9[0][0]            
__________________________________________________________________________________________________
add_22 (Add)                    (None, 24, 24, 64)   0           conv2d_38[0][0]                  
                                                                 conv2d_39[0][0]                  
__________________________________________________________________________________________________
batch_normalization_20 (BatchNo (None, 48, 48, 192)  768         add_21[0][0]                     
__________________________________________________________________________________________________
batch_normalization_21 (BatchNo (None, 24, 24, 64)   256         add_22[0][0]                     
__________________________________________________________________________________________________
add_23 (Add)                    (None, 48, 48, 192)  0           batch_normalization_20[0][0]     
                                                                 re_lu_11[0][0]                   
__________________________________________________________________________________________________
add_24 (Add)                    (None, 24, 24, 64)   0           batch_normalization_21[0][0]     
                                                                 re_lu_12[0][0]                   
__________________________________________________________________________________________________
re_lu_16 (ReLU)                 (None, 48, 48, 192)  0           add_23[0][0]                     
__________________________________________________________________________________________________
re_lu_17 (ReLU)                 (None, 24, 24, 64)   0           add_24[0][0]                     
__________________________________________________________________________________________________
conv2d_41 (Conv2D)              (None, 24, 24, 48)   3072        re_lu_17[0][0]                   
__________________________________________________________________________________________________
average_pooling2d_11 (AveragePo (None, 24, 24, 192)  0           re_lu_16[0][0]                   
__________________________________________________________________________________________________
conv2d_40 (Conv2D)              (None, 48, 48, 48)   9216        re_lu_16[0][0]                   
__________________________________________________________________________________________________
up_sampling2d_10 (UpSampling2D) (None, 48, 48, 48)   0           conv2d_41[0][0]                  
__________________________________________________________________________________________________
conv2d_42 (Conv2D)              (None, 24, 24, 16)   1024        re_lu_17[0][0]                   
__________________________________________________________________________________________________
conv2d_43 (Conv2D)              (None, 24, 24, 16)   3072        average_pooling2d_11[0][0]       
__________________________________________________________________________________________________
add_25 (Add)                    (None, 48, 48, 48)   0           conv2d_40[0][0]                  
                                                                 up_sampling2d_10[0][0]           
__________________________________________________________________________________________________
add_26 (Add)                    (None, 24, 24, 16)   0           conv2d_42[0][0]                  
                                                                 conv2d_43[0][0]                  
__________________________________________________________________________________________________
batch_normalization_22 (BatchNo (None, 48, 48, 48)   192         add_25[0][0]                     
__________________________________________________________________________________________________
batch_normalization_23 (BatchNo (None, 24, 24, 16)   64          add_26[0][0]                     
__________________________________________________________________________________________________
re_lu_18 (ReLU)                 multiple             0           batch_normalization_22[0][0]     
                                                                 batch_normalization_23[0][0]     
__________________________________________________________________________________________________
conv2d_45 (Conv2D)              (None, 24, 24, 48)   6912        re_lu_18[1][0]                   
__________________________________________________________________________________________________
average_pooling2d_12 (AveragePo (None, 24, 24, 48)   0           re_lu_18[0][0]                   
__________________________________________________________________________________________________
conv2d_44 (Conv2D)              (None, 48, 48, 48)   20736       re_lu_18[0][0]                   
__________________________________________________________________________________________________
up_sampling2d_11 (UpSampling2D) (None, 48, 48, 48)   0           conv2d_45[0][0]                  
__________________________________________________________________________________________________
conv2d_46 (Conv2D)              (None, 24, 24, 16)   2304        re_lu_18[1][0]                   
__________________________________________________________________________________________________
conv2d_47 (Conv2D)              (None, 24, 24, 16)   6912        average_pooling2d_12[0][0]       
__________________________________________________________________________________________________
add_27 (Add)                    (None, 48, 48, 48)   0           conv2d_44[0][0]                  
                                                                 up_sampling2d_11[0][0]           
__________________________________________________________________________________________________
add_28 (Add)                    (None, 24, 24, 16)   0           conv2d_46[0][0]                  
                                                                 conv2d_47[0][0]                  
__________________________________________________________________________________________________
batch_normalization_24 (BatchNo (None, 48, 48, 48)   192         add_27[0][0]                     
__________________________________________________________________________________________________
batch_normalization_25 (BatchNo (None, 24, 24, 16)   64          add_28[0][0]                     
__________________________________________________________________________________________________
re_lu_19 (ReLU)                 multiple             0           batch_normalization_24[0][0]     
                                                                 batch_normalization_25[0][0]     
__________________________________________________________________________________________________
conv2d_49 (Conv2D)              (None, 24, 24, 192)  3072        re_lu_19[1][0]                   
__________________________________________________________________________________________________
average_pooling2d_13 (AveragePo (None, 24, 24, 48)   0           re_lu_19[0][0]                   
__________________________________________________________________________________________________
conv2d_48 (Conv2D)              (None, 48, 48, 192)  9216        re_lu_19[0][0]                   
__________________________________________________________________________________________________
up_sampling2d_12 (UpSampling2D) (None, 48, 48, 192)  0           conv2d_49[0][0]                  
__________________________________________________________________________________________________
conv2d_50 (Conv2D)              (None, 24, 24, 64)   1024        re_lu_19[1][0]                   
__________________________________________________________________________________________________
conv2d_51 (Conv2D)              (None, 24, 24, 64)   3072        average_pooling2d_13[0][0]       
__________________________________________________________________________________________________
add_29 (Add)                    (None, 48, 48, 192)  0           conv2d_48[0][0]                  
                                                                 up_sampling2d_12[0][0]           
__________________________________________________________________________________________________
add_30 (Add)                    (None, 24, 24, 64)   0           conv2d_50[0][0]                  
                                                                 conv2d_51[0][0]                  
__________________________________________________________________________________________________
batch_normalization_26 (BatchNo (None, 48, 48, 192)  768         add_29[0][0]                     
__________________________________________________________________________________________________
batch_normalization_27 (BatchNo (None, 24, 24, 64)   256         add_30[0][0]                     
__________________________________________________________________________________________________
add_31 (Add)                    (None, 48, 48, 192)  0           batch_normalization_26[0][0]     
                                                                 re_lu_16[0][0]                   
__________________________________________________________________________________________________
add_32 (Add)                    (None, 24, 24, 64)   0           batch_normalization_27[0][0]     
                                                                 re_lu_17[0][0]                   
__________________________________________________________________________________________________
re_lu_21 (ReLU)                 (None, 48, 48, 192)  0           add_31[0][0]                     
__________________________________________________________________________________________________
re_lu_22 (ReLU)                 (None, 24, 24, 64)   0           add_32[0][0]                     
__________________________________________________________________________________________________
conv2d_53 (Conv2D)              (None, 24, 24, 96)   6144        re_lu_22[0][0]                   
__________________________________________________________________________________________________
average_pooling2d_14 (AveragePo (None, 24, 24, 192)  0           re_lu_21[0][0]                   
__________________________________________________________________________________________________
conv2d_52 (Conv2D)              (None, 48, 48, 96)   18432       re_lu_21[0][0]                   
__________________________________________________________________________________________________
up_sampling2d_13 (UpSampling2D) (None, 48, 48, 96)   0           conv2d_53[0][0]                  
__________________________________________________________________________________________________
conv2d_54 (Conv2D)              (None, 24, 24, 32)   2048        re_lu_22[0][0]                   
__________________________________________________________________________________________________
conv2d_55 (Conv2D)              (None, 24, 24, 32)   6144        average_pooling2d_14[0][0]       
__________________________________________________________________________________________________
add_33 (Add)                    (None, 48, 48, 96)   0           conv2d_52[0][0]                  
                                                                 up_sampling2d_13[0][0]           
__________________________________________________________________________________________________
add_34 (Add)                    (None, 24, 24, 32)   0           conv2d_54[0][0]                  
                                                                 conv2d_55[0][0]                  
__________________________________________________________________________________________________
batch_normalization_28 (BatchNo (None, 48, 48, 96)   384         add_33[0][0]                     
__________________________________________________________________________________________________
batch_normalization_29 (BatchNo (None, 24, 24, 32)   128         add_34[0][0]                     
__________________________________________________________________________________________________
re_lu_23 (ReLU)                 multiple             0           batch_normalization_28[0][0]     
                                                                 batch_normalization_29[0][0]     
__________________________________________________________________________________________________
average_pooling2d_15 (AveragePo multiple             0           re_lu_23[0][0]                   
                                                                 re_lu_23[1][0]                   
                                                                 average_pooling2d_15[0][0]       
__________________________________________________________________________________________________
conv2d_57 (Conv2D)              (None, 12, 12, 96)   27648       average_pooling2d_15[1][0]       
__________________________________________________________________________________________________
conv2d_56 (Conv2D)              (None, 24, 24, 96)   82944       average_pooling2d_15[0][0]       
__________________________________________________________________________________________________
up_sampling2d_14 (UpSampling2D) (None, 24, 24, 96)   0           conv2d_57[0][0]                  
__________________________________________________________________________________________________
conv2d_58 (Conv2D)              (None, 12, 12, 32)   9216        average_pooling2d_15[1][0]       
__________________________________________________________________________________________________
conv2d_59 (Conv2D)              (None, 12, 12, 32)   27648       average_pooling2d_15[2][0]       
__________________________________________________________________________________________________
add_35 (Add)                    (None, 24, 24, 96)   0           conv2d_56[0][0]                  
                                                                 up_sampling2d_14[0][0]           
__________________________________________________________________________________________________
add_36 (Add)                    (None, 12, 12, 32)   0           conv2d_58[0][0]                  
                                                                 conv2d_59[0][0]                  
__________________________________________________________________________________________________
batch_normalization_30 (BatchNo (None, 24, 24, 96)   384         add_35[0][0]                     
__________________________________________________________________________________________________
batch_normalization_31 (BatchNo (None, 12, 12, 32)   128         add_36[0][0]                     
__________________________________________________________________________________________________
re_lu_24 (ReLU)                 multiple             0           batch_normalization_30[0][0]     
                                                                 batch_normalization_31[0][0]     
__________________________________________________________________________________________________
average_pooling2d_16 (AveragePo multiple             0           re_lu_21[0][0]                   
                                                                 re_lu_22[0][0]                   
__________________________________________________________________________________________________
conv2d_61 (Conv2D)              (None, 12, 12, 512)  16384       re_lu_24[1][0]                   
__________________________________________________________________________________________________
conv2d_63 (Conv2D)              (None, 12, 12, 512)  32768       average_pooling2d_16[1][0]       
__________________________________________________________________________________________________
conv2d_60 (Conv2D)              (None, 24, 24, 512)  49152       re_lu_24[0][0]                   
__________________________________________________________________________________________________
up_sampling2d_15 (UpSampling2D) (None, 24, 24, 512)  0           conv2d_61[0][0]                  
__________________________________________________________________________________________________
conv2d_62 (Conv2D)              (None, 24, 24, 512)  98304       average_pooling2d_16[0][0]       
__________________________________________________________________________________________________
up_sampling2d_16 (UpSampling2D) (None, 24, 24, 512)  0           conv2d_63[0][0]                  
__________________________________________________________________________________________________
add_37 (Add)                    (None, 24, 24, 512)  0           conv2d_60[0][0]                  
                                                                 up_sampling2d_15[0][0]           
__________________________________________________________________________________________________
add_38 (Add)                    (None, 24, 24, 512)  0           conv2d_62[0][0]                  
                                                                 up_sampling2d_16[0][0]           
__________________________________________________________________________________________________
batch_normalization_32 (BatchNo (None, 24, 24, 512)  2048        add_37[0][0]                     
__________________________________________________________________________________________________
batch_normalization_33 (BatchNo (None, 24, 24, 512)  2048        add_38[0][0]                     
__________________________________________________________________________________________________
add_39 (Add)                    (None, 24, 24, 512)  0           batch_normalization_32[0][0]     
                                                                 batch_normalization_33[0][0]     
__________________________________________________________________________________________________
re_lu_25 (ReLU)                 (None, 24, 24, 512)  0           add_39[0][0]                     
__________________________________________________________________________________________________
conv2d_64 (Conv2D)              (None, 24, 24, 128)  65536       re_lu_25[0][0]                   
__________________________________________________________________________________________________
batch_normalization_34 (BatchNo (None, 24, 24, 128)  512         conv2d_64[0][0]                  
__________________________________________________________________________________________________
re_lu_26 (ReLU)                 (None, 24, 24, 128)  0           batch_normalization_34[0][0]     
__________________________________________________________________________________________________
conv2d_65 (Conv2D)              (None, 24, 24, 128)  147456      re_lu_26[0][0]                   
__________________________________________________________________________________________________
batch_normalization_35 (BatchNo (None, 24, 24, 128)  512         conv2d_65[0][0]                  
__________________________________________________________________________________________________
re_lu_27 (ReLU)                 (None, 24, 24, 128)  0           batch_normalization_35[0][0]     
__________________________________________________________________________________________________
conv2d_66 (Conv2D)              (None, 24, 24, 512)  65536       re_lu_27[0][0]                   
__________________________________________________________________________________________________
batch_normalization_36 (BatchNo (None, 24, 24, 512)  2048        conv2d_66[0][0]                  
__________________________________________________________________________________________________
add_40 (Add)                    (None, 24, 24, 512)  0           batch_normalization_36[0][0]     
                                                                 re_lu_25[0][0]                   
__________________________________________________________________________________________________
re_lu_28 (ReLU)                 (None, 24, 24, 512)  0           add_40[0][0]                     
__________________________________________________________________________________________________
avg_pool (GlobalAveragePooling2 (None, 512)          0           re_lu_28[0][0]                   
__________________________________________________________________________________________________
fc (Dense)                      (None, 2)            1026        avg_pool[0][0]                   
==================================================================================================
Total params: 964,034
Trainable params: 956,226
Non-trainable params: 7,808
__________________________________________________________________________________________________
